export default function About4({ h4Styles, paragraphStyles }){
  return (
    <div className="px-6 md:px-32 lg:px-64 xl:px-72">
      <h4 className={h4Styles}>初めての国際交流が、とにかく楽しかった。</h4>

      <p className={paragraphStyles}>2005年7月、16歳。高校交換留学。ほとんど英語が話せない状態で、初めてのアメリカ上陸、ノースダコタ州へ!</p>

      <p className={paragraphStyles}>現地の学校に行く前の1か月の事前研修に、世界各地(日本、フランス、中国、台湾)から留学生17名集められましたが、なんと私は、英語のクラス分けで一番下のレベルでした。ほぼ出川イングリッシュで他の国の人とコミュニケーションをとっていました。でも、楽しかった!あれから約20年経った今も、彼らとはたまに連絡を取っています。</p>

      <h4 className={h4Styles}>ホストファミリーと現地高校の英語漬けの生活。</h4>

      <p className={paragraphStyles}>9月、ミネソタ州のホストファミリーと住み始めました。1か月の研修だけですぐに英語が話せるようになるほど甘くはないので、とにかく「誤解」の連続!とても優しい家族でしたが、よくケンカはしていました。でもその度に「喧嘩できるぐらい英語が伸びてる!」と少し嬉しかったのです。</p>

      <p className={paragraphStyles}>半年経った時初めて英語で夢を見ました。ネットも家に無い、LINEもSkypeも無い、国際電話はめちゃくちゃ高いから日本の友達や家族と話す機会はほとんどない。学校でも家でも夢の中でも24時間英語だけの生活のおかげで、みるみる英語が伸びていきました。</p>

      <h4 className={h4Styles}>違うことだらけの海外学校生活。</h4>
			
      <p className={paragraphStyles}>学校生活なしにはやはり留学は語れません。田舎町の3つの地域から子供たちが集まった小さな学校だったので、アジア人は私だけで、良くも悪くも目立っていました。最初は英語が下手だったので、からかわれたり、相手にされないこともあり、悔しくて学校に行きたくないこともありましたが、結果的にとても良い友人に恵まれました。映画でしか見たことがなかったプロムにも行きました。旅行先のホテルで、お風呂の湯気で部屋を満たして「サウナしようぜ」と言ったバカな友人もいました。みんなでパンツ一丁になって、腹を抱えて笑いました。</p>
    </div>
  )
}