import "./about.css";

export default function About2(){
  return (
    <>
      <h4 className="about-subtitles">一味も二味も違った、本間家の教育。</h4>

      <p className="paragraph-styles">両親が言っていた言葉で一番心に残っているのは「人と違うことはかっこいい」というものかもしれません。例え他多数が自分と違う意見でも、思っていることをちゃんと言うのがいいと信じて育ちました。今も昔も、一番好きなアニメはセーラームーンで、小さい頃から好きなものを好きと言って、それを尊重してくれる環境があったことにはとても感謝しています。保育園にセーラームーンの靴を履いて行った時、私の母は、他のお母さんたちに「そうちゃん男の子なのになんでセーラムーンの靴なんて履かせてるの?」と言われ、母は「好きだからです」ときっぱり言い放ったそうです。笑</p>

      <p className="paragraph-styles">それから、本間家では「子ども扱い」という言葉はなかったように思います。逆に言うと「子供だから仕方ない」という免罪符もありませんでした。自然派の食卓だったので、大人と一緒にスパイスから作った辛口のカレーを食べていましたし、お菓子は煎餅しか食べませんでしたので、あの頃は子供の味覚に合うお菓子がたくさん出る友達の家がとても羨ましかったです。家では家族会議や意見交換ノートがあり、そこで必ず「そうちゃんはどう思うの？」と聞かれていました。ちゃんと話せないと自分の意見は受け入れてもらえない為、論理だてて説明することを徹底せざるを得なかったのです。</p>
			
      <p className="paragraph-styles">習い事も、塾も、自習も、受験も、すべて自分次第。親から言われてすることは一つもなく、すべて自分で決めなければならないという環境下で、自分で調べ、理由を持って決断をしました。なんでもやりたがった妹に対して、私は子供ながらに何か明確な理由が無いと続かないと思っていたので、習い事はほとんどしませんでした。唯一通った習い事は、小学校6年生の時に珍しく自分から「行きたい」と言った子供英会話スクールでした。</p>
    </>
  )
}