export default function About3({ h4Styles, paragraphStyles }){
  return (
    <div className="px-6 md:px-32 lg:px-64 xl:px-72">
      <h4 className={h4Styles}>発音から始まった、英語の旅。</h4>

      <p className={paragraphStyles}>英会話スクールで最初に学んだのはフォニックスです。今でこそ有名な、英語のスペルと音の関係を学ぶフォニックスですが、あの頃にカリキュラムに取り入れていたスクールは少なかったと思います。私は日本語に無いRの音がとても好きでした。Rabbit、Run、Really?と、Rが付く単語を知っていくことや、スペルと音のルールを覚えたことで、誰の助けも無く、いわば自転車の補助輪なしで、今まで読めなかったものが読めるようになったのも嬉しかった。横田基地のネイティブの先生と、発音ネイティブの日本人の先生の会話もとってもかっこよかったですし、それを真似て自分の口から英語っぽい音が出てくるのもとても心地よかったのです。</p>

      <h4 className={h4Styles}>自分のセクシャリティに悩んだ思春期。</h4>

      <p className={paragraphStyles}>12歳の時、初めて男性に興味があると自覚しました。あの頃は、他の人にばれたらもう生きていられないと思っていたものです。神社に行けば「普通の人に戻れますように!」と本気で神頼みをしていました。</p>

      <h4 className={h4Styles}>変わりたい一心で決断した、初めての留学。</h4>
			
      <p className={paragraphStyles}>留学した理由はたくさんありますが、思い返すと、とにかく変わりたかったように思えます。ゲイである自分が大嫌いなのに、隠した自分がドンドンと内からドアを叩いて、開けようとしてくる、そんな生活が苦しかった。自分のことを知っている人が一人もいない、真新しい環境に行き、一からやり直せば、変われるかもしれないと思い、留学を決意しました。</p>
    </div>
  )
}